app/Http/Controllers/PostLikeController.php

    public function store(Post $post, Request $request)
    {
        if ($post->likedBy($request->user())) {
            return response(null, 409);
        }

        $post->likes()->create([
            'user_id' => $request->user()->id
        ]);

        if (!$post->likes()->onlyTrashed()->where('user_id', $request->user()->id)->count()) {
---
insert into "likes" ("user_id", "post_id", "updated_at", "created_at") values (2, 59, '2023-12-02 17:19:34', '2023-12-02 17:19:34') returning "id"
select count(*) as aggregate from "likes" where "likes"."post_id" = 59 and "likes"."post_id" is not null and "likes"."deleted_at" is not null and "user_id" = 2

    public function destroy(Post $post, Request $request)
    {
        $request->user()->likes()->where('post_id', $post->id)->delete();
---
delete from "likes" where "likes"."user_id" = 3 and "likes"."user_id" is not null and "post_id" = 56
update "likes" set "deleted_at" = '2023-12-02 17:19:42', "updated_at" = '2023-12-02 17:19:42' where "likes"."user_id" = 2 and "likes"."user_id" is not null and "post_id" = 59 and "likes"."deleted_at" is null