app/Http/Controllers/PostController.php

    public function index()
    {
        $posts = Post::latest()->with('user', 'likes')->paginate(2);
---
select * from "likes" where "likes"."post_id" in (205, 206) and "likes"."deleted_at" is null
select * from "posts" order by "created_at" desc limit 2 offset 0
select * from "users" where "users"."id" in (2, 3)
select count(*) as aggregate from "posts"

    public function store(Request $request)
    {
        $this->validate($request, [
            'body' => 'required'
        ]);

        $request->user()->posts()->create([
            'body' => $request->body
        ]);
---
insert into "posts" ("body", "user_id", "updated_at", "created_at") values ('dddd', 2, '2023-12-02 16:30:42', '2023-12-02 16:30:42') returning "id"

    public function destroy(Post $post)
    {
        $this->authorize("delete", $post); //
        $post->delete();
---
delete from "posts" where "id" = 3